app/controllers/emails_controller.rb

  def index
    @emails = Email.all
---
SELECT  "emails".* FROM "emails" ORDER BY "emails"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def create
    @email = Email.create(object: Faker::Book.title, body: Faker::Lorem.paragraph)
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def show
    @id = params[:id]
    @email = Email.find(@id)
    @email.update(read: true)
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 72], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2019-05-23 14:13:22.954651"], ["id", 88]]

  def destroy
    @id = params[:id]
    @email = Email.find(@id)
    @email.destroy
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 82]]

  def update
    @id = params[:id]
    @email = Email.find(@id)
    @email.update(read:false)
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 88], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", false], ["updated_at", "2019-05-23 14:18:11.210291"], ["id", 88]]