app/views/email/index.html.erb

  </div>
  <div class="col-8"> <%= render "each", e: Email.find(1) %> </div>
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]