app/views/emails/index.html.erb

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <div class="col-8">
    <%= render "each", e: Email.find(1) %>